app/controllers/allergies_controller.rb

    def index
        @profile = Profile.find_by(email: params[:profile_email])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]

    def new
        @profile = Profile.find_by(email: params[:profile_email])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]

    def edit
        @allergy = Allergy.find(params[:id])
---
SELECT  "allergies".* FROM "allergies" WHERE "allergies"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

	def create
        @allergy = Allergy.new(allergy_params)
        @profile = Profile.find_by(email: params[:profile_email])

        @allergy.profile = @profile

        if @allergy.save
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
INSERT INTO "allergies" ("name", "description", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
        @allergy = Allergy.find(params[:id])

        if @allergy.update(allergy_params)
---
SELECT  "allergies".* FROM "allergies" WHERE "allergies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "allergies" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "allergies"."id" = $4  [["name", "Buscopan"], ["description", "Princípio Ativo: Dipirona Sódica"], ["updated_at", "2018-11-18 21:31:02.447819"], ["id", 5]]

    def destroy
        @allergy = Allergy.find(params[:id])

        profile_email = @allergy.profile.email

        @allergy.destroy
---
SELECT  "allergies".* FROM "allergies" WHERE "allergies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "allergies" WHERE "allergies"."id" = $1  [["id", 1]]