app/controllers/application_controller.rb

  def recover_profile
    email = params[:profile_email] || params[:email]

    @profile = Profile.find_by(email: email) if email
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "teste@gmail.com"], ["LIMIT", 1]]