app/controllers/contacts_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
---
    def index
        @profile = Profile.find_by(email: params[:profile_email])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
---
    def new
        @profile = Profile.find_by(email: params[:profile_email])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @contact = Contact.find(params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
INSERT INTO "contacts" ("email", "name", "phone", "mobile", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
        @profile = Profile.find_by(email: params[:profile_email])
        @contact = Contact.new(contact_params)

        @contact.profile = @profile

        if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "contacts" SET "email" = $1, "name" = $2, "phone" = $3, "mobile" = $4, "updated_at" = $5 WHERE "contacts"."id" = $6  [["email", "petrus@exemplo.org"], ["name", "Petrus"], ["phone", "1120201323"], ["mobile", "11982838128"], ["updated_at", "2018-11-18 21:31:04.997722"], ["id", 8]]
---
    def update
        @contact = Contact.find(params[:id])

        if @contact.update(contact_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 6]]
---
    def destroy
        @contact = Contact.find(params[:id])

        profile_email = @contact.profile.email

        @contact.destroy