app/controllers/glucose_measures_controller.rb

SELECT  "glucose_measures".* FROM "glucose_measures" WHERE "glucose_measures"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @glucose_measure = GlucoseMeasure.find_by(id: params[:id])

INSERT INTO "glucose_measures" ("value", "date", "fasting", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["value", 1.0], ["date", "2018-11-18 19:31:00"], ["fasting", true], ["profile_id", 238], ["created_at", "2018-11-18 21:31:27.937039"], ["updated_at", "2018-11-18 21:31:27.937039"]]
---
  def create
    @glucose_measure = GlucoseMeasure.new(glucose_measure_params)
    @glucose_measure.profile = @profile
    if @glucose_measure.save

SELECT  "glucose_measures".* FROM "glucose_measures" WHERE "glucose_measures"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "glucose_measures" SET "value" = $1, "fasting" = $2, "date" = $3, "updated_at" = $4 WHERE "glucose_measures"."id" = $5  [["value", 50.0], ["fasting", true], ["date", "2018-11-18 19:31:00"], ["updated_at", "2018-11-18 21:31:00.578342"], ["id", 8]]
---
  def update
    @glucose_measure = GlucoseMeasure.find_by(id: params[:id])

    if @glucose_measure.update(glucose_measure_params)

SELECT  "glucose_measures".* FROM "glucose_measures" WHERE "glucose_measures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "glucose_measures" WHERE "glucose_measures"."id" = $1  [["id", 3]]
---
  def destroy
    @glucose_measure = GlucoseMeasure.find(params[:id])

    if @glucose_measure.destroy