app/controllers/hdls_controller.rb

    def edit
        @hdl = Hdl.find(params[:id])
---
SELECT  "hdls".* FROM "hdls" WHERE "hdls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        @hdl = Hdl.new(hdl_params)

        @hdl.profile = @profile

        if @hdl.save
---
INSERT INTO "hdls" ("value", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 140], ["date", "2018-10-21"], ["profile_id", 10], ["created_at", "2018-11-15 16:10:30.721144"], ["updated_at", "2018-11-15 16:10:30.721144"]]

    def update
        @hdl = Hdl.find(params[:id])

        if @hdl.update(hdl_params)
---
SELECT  "hdls".* FROM "hdls" WHERE "hdls"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "hdls" SET "date" = $1, "value" = $2, "updated_at" = $3 WHERE "hdls"."id" = $4  [["date", "2018-10-25"], ["value", 121], ["updated_at", "2018-11-18 21:31:04.513700"], ["id", 8]]

    def destroy
        @hdl = Hdl.find(params[:id])

        profile_email = @hdl.profile.email

        @hdl.destroy
---
SELECT  "hdls".* FROM "hdls" WHERE "hdls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "hdls" WHERE "hdls"."id" = $1  [["id", 1]]