app/controllers/heights_controller.rb

    def index
        @profile = Profile.find_by(email: params[:profile_email])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]

    def new
        @profile = Profile.find_by(email: params[:profile_email])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]

    def edit
        @height = Height.find(params[:id])
---
SELECT  "heights".* FROM "heights" WHERE "heights"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @profile = Profile.find_by(email: params[:profile_email])
        @height = Height.new(height_params)

        @height.profile = @profile

        if @height.save
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
INSERT INTO "heights" ("value", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", "1.65"], ["date", "2017-12-21"], ["profile_id", 244], ["created_at", "2018-11-18 21:31:31.227965"], ["updated_at", "2018-11-18 21:31:31.227965"]]

    def update
        @height = Height.find(params[:id])

        if @height.update(height_params)
---
SELECT  "heights".* FROM "heights" WHERE "heights"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "heights" SET "date" = $1, "value" = $2, "updated_at" = $3 WHERE "heights"."id" = $4  [["date", "2018-06-25"], ["value", "1.85"], ["updated_at", "2018-11-18 21:31:06.692786"], ["id", 10]]

    def destroy
        @height = Height.find(params[:id])

        profile_email = @height.profile.email

        @height.destroy
---
SELECT  "heights".* FROM "heights" WHERE "heights"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "heights" WHERE "heights"."id" = $1  [["id", 12]]