app/controllers/ldls_controller.rb

SELECT  "ldls".* FROM "ldls" WHERE "ldls"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @ldl = Ldl.find(params[:id])

INSERT INTO "ldls" ("value", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 140], ["date", "2018-10-21"], ["profile_id", 247], ["created_at", "2018-11-18 21:31:32.830864"], ["updated_at", "2018-11-18 21:31:32.830864"]]
---
  def create
    @ldl = Ldl.new(ldl_params)

    @ldl.profile = @profile

    if @ldl.save

SELECT  "ldls".* FROM "ldls" WHERE "ldls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "ldls" SET "date" = $1, "value" = $2, "updated_at" = $3 WHERE "ldls"."id" = $4  [["date", "2018-10-25"], ["value", 90], ["updated_at", "2018-11-18 21:31:00.834061"], ["id", 3]]
---
  def update
    @ldl = Ldl.find(params[:id])

    if @ldl.update(ldl_params)

SELECT  "ldls".* FROM "ldls" WHERE "ldls"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "ldls" WHERE "ldls"."id" = $1  [["id", 5]]
---
  def destroy
    @ldl = Ldl.find(params[:id])

    profile_email = @ldl.profile.email

    @ldl.destroy