app/controllers/medications_controller.rb

def index
    @profile = Profile.find_by(email: params[:profile_email])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]

def new
    @profile = Profile.find_by(email: params[:profile_email])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]

def edit
    @medication = Medication.find(params[:id])
---
SELECT  "medications".* FROM "medications" WHERE "medications"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

def create

    @profile = Profile.find_by(email: params[:profile_email])
    @medication = Medication.new(medication_params)

    @medication.profile = @profile

    if @medication.save
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
INSERT INTO "medications" ("name", "categorize", "start", "finish", "dosage", "infadd", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

def update
    @medication = Medication.find(params[:id])

    if @medication.update(medication_params)
---
SELECT  "medications".* FROM "medications" WHERE "medications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "medications" SET "name" = $1, "categorize" = $2, "start" = $3, "finish" = $4, "dosage" = $5, "infadd" = $6, "updated_at" = $7 WHERE "medications"."id" = $8

def destroy
    @medication = Medication.find(params[:id])

    profile_email = @medication.profile.email

    @medication.destroy
---
SELECT  "medications".* FROM "medications" WHERE "medications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "medications" WHERE "medications"."id" = $1  [["id", 1]]