app/controllers/nonhdls_controller.rb

    def edit
        @non_hdl = NonHdl.find(params[:id])
---
SELECT  "non_hdls".* FROM "non_hdls" WHERE "non_hdls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @non_hdl = NonHdl.new(nonhdl_params)

        @non_hdl.profile = @profile

        if @non_hdl.save
---
INSERT INTO "non_hdls" ("value", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 140], ["date", "2018-10-21"], ["profile_id", 22], ["created_at", "2018-11-15 16:10:33.002034"], ["updated_at", "2018-11-15 16:10:33.002034"]]

    def update
        @non_hdl = NonHdl.find(params[:id])

        if @non_hdl.update(nonhdl_params)
---
SELECT  "non_hdls".* FROM "non_hdls" WHERE "non_hdls"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "non_hdls" SET "date" = $1, "updated_at" = $2 WHERE "non_hdls"."id" = $3  [["date", "2018-10-25"], ["updated_at", "2018-11-18 21:31:05.371982"], ["id", 8]]

    def destroy
        @non_hdl = NonHdl.find(params[:id])

        profile_email = @non_hdl.profile.email

        @non_hdl.destroy
---
SELECT  "non_hdls".* FROM "non_hdls" WHERE "non_hdls"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "non_hdls" WHERE "non_hdls"."id" = $1  [["id", 4]]