app/controllers/platelets_controller.rb

  def edit
    @platelet = Platelet.find(params[:id])
---
SELECT  "platelets".* FROM "platelets" WHERE "platelets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @platelet = Platelet.new(platelet_params)

    @platelet.profile = @profile

    if @platelet.save
---
INSERT INTO "platelets" ("erythrocyte", "hemoglobin", "hematocrit", "vcm", "hcm", "chcm", "rdw", "leukocytep", "neutrophilp", "eosinophilp", "basophilp", "lymphocytep", "monocytep", "leukocyteul", "neutrophilul", "eosinophilul", "basophilul", "lymphocyteul", "monocyteul", "total", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23) RETURNING "id"

  def update
    @platelet = Platelet.find(params[:id])

    if @platelet.update(platelet_params)
---
SELECT  "platelets".* FROM "platelets" WHERE "platelets"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "platelets" SET "erythrocyte" = $1, "hemoglobin" = $2, "hematocrit" = $3, "vcm" = $4, "hcm" = $5, "chcm" = $6, "rdw" = $7, "leukocytep" = $8, "neutrophilp" = $9, "eosinophilp" = $10, "basophilp" = $11, "lymphocytep" = $12, "monocytep" = $13, "leukocyteul" = $14, "neutrophilul" = $15, "eosinophilul" = $16, "basophilul" = $17, "lymphocyteul" = $18, "monocyteul" = $19, "total" = $20, "updated_at" = $21 WHERE "platelets"."id" = $22

  def destroy
    @platelet = Platelet.find(params[:id])

    profile_email = @platelet.profile.email

    @platelet.destroy
---
SELECT  "platelets".* FROM "platelets" WHERE "platelets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "platelets" WHERE "platelets"."id" = $1  [["id", 3]]