app/controllers/pressures_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
---
  def new
     @profile = Profile.find_by(email: params[:profile_email])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
---
  def index
    #@pressures = Pressure.all
    @profile = Profile.find_by(params[:email])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
INSERT INTO "pressures" ("systolic", "diastolic", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["systolic", 80], ["diastolic", 10], ["date", "2018-11-17 21:31:03"], ["profile_id", 127], ["created_at", "2018-11-18 21:31:03.111585"], ["updated_at", "2018-11-18 21:31:03.111585"]]
INSERT INTO "pressures" ("systolic", "diastolic", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["systolic", 1], ["diastolic", 10], ["date", "2018-11-18 19:31:00"], ["profile_id", 259], ["created_at", "2018-11-18 21:31:39.416034"], ["updated_at", "2018-11-18 21:31:39.416034"]]
---
  def create
      #@pressure = Pressure.new(pressure_create_params)
      @profile = Profile.find_by(params[:email])
      @pressure = @profile.pressures.create(pressure_create_params)

      if @pressure.save

SELECT  "pressures".* FROM "pressures" WHERE "pressures"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @pressure = Pressure.find_by(id: params[:id])

SELECT  "pressures".* FROM "pressures" WHERE "pressures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "pressures" SET "systolic" = $1, "diastolic" = $2, "updated_at" = $3 WHERE "pressures"."id" = $4  [["systolic", 22], ["diastolic", 11], ["updated_at", "2018-11-18 21:31:03.232475"], ["id", 3]]
---
  def update
    @pressure = Pressure.find_by(id: params[:id])

    if @pressure.update(pressure_update_params)

SELECT  "pressures".* FROM "pressures" WHERE "pressures"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "pressures" WHERE "pressures"."id" = $1  [["id", 10]]
---
  def destroy
    @pressure = Pressure.find(params[:id])

    if @pressure.destroy