app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles"
---
  def index
    @profiles = Profile.all

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "marcelopmartins1@gmail.com"], ["LIMIT", 1]]
---
  def show
    @profile = Profile.find_by(email: params[:email])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joana_silva@example.org"], ["LIMIT", 1]]
---
  def edit
    @profile = Profile.find_by(email: params[:email])

INSERT INTO "profiles" ("email", "firstname", "lastname", "birthdate", "sex", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create

    @profile = Profile.new(profile_create_params)

    if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joana_silva@example.org"], ["LIMIT", 1]]
UPDATE "profiles" SET "birthdate" = $1, "sex" = $2, "gender" = $3, "updated_at" = $4 WHERE "profiles"."id" = $5  [["birthdate", "1999-12-13"], ["sex", "Female"], ["gender", "Feminino"], ["updated_at", "2018-11-15 16:10:35.337477"], ["id", 31]]
---
  def update
    @profile = Profile.find_by(email: params[:email])

    if @profile.update(profile_update_params)