app/controllers/reactions_controller.rb

    def edit
        @reaction = Reaction.find(params[:id])
---
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

	def create
        @reaction = Reaction.new(reaction_params)

        @reaction.profile = @profile

        if @reaction.save
---
INSERT INTO "reactions" ("name", "cause", "description", "start", "finish", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
        @reaction = Reaction.find(params[:id])

        if @reaction.update(reaction_params)
---
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "reactions" SET "start" = $1, "name" = $2, "cause" = $3, "description" = $4, "finish" = $5, "updated_at" = $6 WHERE "reactions"."id" = $7  [["start", "2018-06-25"], ["name", "Buscopan"], ["cause", "Medication"], ["description", "Tontura"], ["finish", "2018-11-17"], ["updated_at", "2018-11-18 21:31:02.093752"], ["id", 8]]

    def destroy
        @reaction = Reaction.find(params[:id])

        profile_email = @reaction.profile.email

        @reaction.destroy
---
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "reactions" WHERE "reactions"."id" = $1  [["id", 6]]