app/controllers/totals_controller.rb

SELECT  "totals".* FROM "totals" WHERE "totals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @total = Total.find(params[:id])

INSERT INTO "totals" ("value", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 140], ["date", "2018-10-21"], ["profile_id", 265], ["created_at", "2018-11-18 21:31:42.729135"], ["updated_at", "2018-11-18 21:31:42.729135"]]
---
  def create
    @total = Total.new(total_params)

    @total.profile = @profile

    if @total.save

SELECT  "totals".* FROM "totals" WHERE "totals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "totals" SET "date" = $1, "value" = $2, "updated_at" = $3 WHERE "totals"."id" = $4  [["date", "2018-10-25"], ["value", 190], ["updated_at", "2018-11-18 21:31:05.622781"], ["id", 6]]
---
  def update
    @total = Total.find(params[:id])

    if @total.update(total_params)

SELECT  "totals".* FROM "totals" WHERE "totals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "totals" WHERE "totals"."id" = $1  [["id", 10]]
---
  def destroy
    @total = Total.find(params[:id])

    profile_email = @total.profile.email

    @total.destroy