app/controllers/vldls_controller.rb

    def edit
        @vldl = Vldl.find(params[:id])
---
SELECT  "vldls".* FROM "vldls" WHERE "vldls"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def create
        @vldl = Vldl.new(vldl_params)

        @vldl.profile = @profile

        if @vldl.save
---
INSERT INTO "vldls" ("value", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 140], ["date", "2018-10-21"], ["profile_id", 34], ["created_at", "2018-11-15 16:10:35.946915"], ["updated_at", "2018-11-15 16:10:35.946915"]]

    def update
        @vldl = Vldl.find(params[:id])

        if @vldl.update(vldl_params)
---
SELECT  "vldls".* FROM "vldls" WHERE "vldls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "vldls" SET "date" = $1, "value" = $2, "updated_at" = $3 WHERE "vldls"."id" = $4  [["date", "2018-10-25"], ["value", 85], ["updated_at", "2018-11-18 21:31:01.391819"], ["id", 3]]

    def destroy
        @vldl = Vldl.find(params[:id])

        profile_email = @vldl.profile.email

        @vldl.destroy
---
SELECT  "vldls".* FROM "vldls" WHERE "vldls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "vldls" WHERE "vldls"."id" = $1  [["id", 1]]