app/controllers/weights_controller.rb

    def index
        @profile = Profile.find_by(email: params[:profile_email])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]

    def new
        @profile = Profile.find_by(email: params[:profile_email])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]

    def edit
        @weight = Weight.find(params[:id])
---
SELECT  "weights".* FROM "weights" WHERE "weights"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

    def create
        @profile = Profile.find_by(email: params[:profile_email])
        @weight = Weight.new(weight_params)

        @weight.profile = @profile

        if @weight.save
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "joao@example.org"], ["LIMIT", 1]]
INSERT INTO "weights" ("value", "date", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", "67.0"], ["date", "2017-12-21"], ["profile_id", 275], ["created_at", "2018-11-18 21:31:49.918558"], ["updated_at", "2018-11-18 21:31:49.918558"]]

    def update
        @weight = Weight.find(params[:id])

        if @weight.update(weight_params)
---
SELECT  "weights".* FROM "weights" WHERE "weights"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "weights" SET "date" = $1, "value" = $2, "updated_at" = $3 WHERE "weights"."id" = $4  [["date", "2018-06-25"], ["value", "65.0"], ["updated_at", "2018-11-18 21:31:03.962382"], ["id", 7]]

    def destroy
        @weight = Weight.find(params[:id])

        profile_email = @weight.profile.email

        @weight.destroy
---
SELECT  "weights".* FROM "weights" WHERE "weights"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "weights" WHERE "weights"."id" = $1  [["id", 3]]