app/models/profile.rb

SELECT  "weights".* FROM "weights" WHERE "weights"."profile_id" = $1 ORDER BY "weights"."date" DESC LIMIT $2  [["profile_id", 5], ["LIMIT", 1]]
---
  def latest_weight
    self.weights.order(:date).reverse_order().take

SELECT  "heights".* FROM "heights" WHERE "heights"."profile_id" = $1 ORDER BY "heights"."date" DESC LIMIT $2  [["profile_id", 5], ["LIMIT", 1]]
---
  def latest_height
    self.heights.order(:date).reverse_order().take